<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
return [
    // 日志记录方式，内置 file socket 支持扩展
    'type'  => 'File',

    // 日志保存目录
    'path'  => '',

    //设置某些级别的日志信息单独文件记录
    'apart_level'   =>  ['error','warning','info','sql'],

    // 日志记录级别
    'level' => ['info','warning','error','critical','emergency','sql'],

    //超过数量的最早日志将会自动删除,设置max_files参数后，日志文件将不会分日期子目录存放
    //'max_files'	=>	30,

    // 日志的时间格式，默认是` c `
    'time_format'   =>  'Y-m-d H:i:s',

    //'format' => '[%s][%s] %s',

    'file_size' => 1024*1024*2,

    'realtime_write' => true,
];
